## Plan for api
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`





```terraform
Plan: 3 to add, 2 to change, 0 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_api_gateway_stage.api will be updated in-place
  ~ resource "aws_api_gateway_stage" "api" {
      - cache_cluster_size    = "0.5" -> null
        id                    = "ags-s50ry4jhg5-v1"
        tags                  = {}
        # (10 unchanged attributes hidden)
    }

  # aws_lambda_function.api will be updated in-place
  ~ resource "aws_lambda_function" "api" {
      - code_signing_config_arn        = "" -> null
      - description                    = "" -> null
      - handler                        = "" -> null
        id                             = "api"
      - kms_key_arn                    = "" -> null
      - runtime                        = "" -> null
      - signing_job_arn                = "" -> null
      - signing_profile_version_arn    = "" -> null
        tags                           = {}
        # (17 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "AXE_CORE_REPORT_DATA_BUCKET"  = "scan-websites-production-axe-core-report-data"
              - "AXE_CORE_URLS_TOPIC"          = "arn:aws:sns:ca-central-1:507252742351:axe-core-urls"
              - "FASTAPI_SECRET_KEY"           = (sensitive)
              - "GOOGLE_CLIENT_ID"             = (sensitive)
              - "GOOGLE_CLIENT_SECRET"         = (sensitive)
              - "OWASP_ZAP_REPORT_DATA_BUCKET" = "scan-websites-production-owasp-zap-report-data"
              - "OWASP_ZAP_URLS_TOPIC"         = "arn:aws:sns:ca-central-1:507252742351:owasp-zap-urls"
              - "SQLALCHEMY_DATABASE_URI"      = (sensitive)
            } -> (known after apply)
        }


        # (2 unchanged blocks hidden)
    }

  # aws_sns_topic.owasp-zap-urls will be created
  + resource "aws_sns_topic" "owasp-zap-urls" {
      + arn                         = (known after apply)
      + content_based_deduplication = false
      + fifo_topic                  = false
      + id                          = (known after apply)
      + kms_master_key_id           = "arn:aws:kms:ca-central-1:507252742351:key/f0adf18d-9e68-4641-be1a-55a6a91cca02"
      + name                        = "owasp-zap-urls"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + tags                        = {
          + "CostCenter" = "scan-websites-production"
        }
      + tags_all                    = {
          + "CostCenter" = "scan-websites-production"
        }
    }

  # module.owasp-zap-report-data.aws_s3_bucket.this will be created
  + resource "aws_s3_bucket" "this" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "scan-websites-production-owasp-zap-report-data"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "CostCentre" = "scan-websites-production"
          + "Terraform"  = "true"
        }
      + tags_all                    = {
          + "CostCentre" = "scan-websites-production"
          + "Terraform"  = "true"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + lifecycle_rule {
          + enabled = true
          + id      = "expire"

          + expiration {
              + days = 30
            }
        }

      + logging {
          + target_bucket = "scan-websites-production-logs"
          + target_prefix = "scan-websites-production-owasp-zap-report-data"
        }

      + server_side_encryption_configuration {
          + rule {
              + apply_server_side_encryption_by_default {
                  + sse_algorithm = "AES256"
                }
            }
        }

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }
    }

  # module.owasp-zap-report-data.aws_s3_bucket_public_access_block.this will be created
  + resource "aws_s3_bucket_public_access_block" "this" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

Plan: 3 to add, 2 to change, 0 to destroy.

Changes to Outputs:
  ~ owasp_zap_report_data_bucket_arn = "arn:aws:s3:::scan-websites-production-owasp-zap-report-data" -> (known after apply)
  ~ owasp_zap_report_data_bucket_id  = "scan-websites-production-owasp-zap-report-data" -> (known after apply)
  ~ owasp_zap_urls_topic_arn         = "arn:aws:sns:ca-central-1:507252742351:owasp-zap-urls" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>